#include<iostream>
#include<Windows.h>

using namespace std;

int main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	// 20.01.2026


	/*Користувач вводить із клавіатури грошову суму в гривнях і копійках
	(гривні та копійки вводяться в різні змінні).Сума може бути введена 
	як правильно(наприклад 19 грн. 90 коп.), так і неправильно
	(наприклад 22 грн. 978 коп.).Написати програму, яка, використовуючи 
	тільки лінійний алгоритм, здійснить коригування введеної грошової 
	суми в правильну форму.
	Наприклад, якщо користувач ввів 11 грн. 150 коп., програма повинна 
	вивести на екран суму 12 грн. 50 коп.*/


	/*int a, b, c;

	cin >> a >> b;
	a += b / 100.;
	b %= 100;
	cout << a << " грн. " << b << " коп." << endl;*/

	/*Користувач вводить із клавіатури час у секундах, що минув від початку дня.
	Вивести на екран поточний час у годинах, хвилинах і секундах.Порахувати 
	скільки годин, хвилин і секунд залишилося до опівночі.*/

	/*int s;
	cin >> s;
	s = 86400 - s;
	cout << s / 3600 << ":" << s / 60 % 60 << ":" << s % 60 << endl;*/
	

	//Користувач вводить із клавіатури три цілих числа.Порахувати їхню суму, добуток і середнє арифметичне.

	/*int a, b, c;
	cout << "Перше число: ";
	cin >> a;
	cout << "Друге число: ";
	cin >> b;
	cout << "Третє число: ";
	cin >> c;
	cout << endl;
	cout << "Сума чисел: " << a + b + c << endl;
	cout << "Сума чисел: " << a * b * c << endl;
	float d = (a + b + c) / 3.f;
	cout << "Сума чисел: " << d << endl;*/


	//Користувач вводить із клавіатури розмір одного файлу в гігабайтах і 
	// швидкість інтернет - з'єднання в бітах на секунду. Порахувати за скільки 
	// годин, хвилин і секунд завантажиться фільм.



	// - ++ --
	// = + - * / % += -= *= /= %= ()
	/*a++;
	++a;*/

	//a = -a;

	//c = ++a * (a++ + --b/2);
	//cout << a << endl; // 7
	//cout << b << endl; // 3
	//cout << c << endl; // 42

	//cout << a << endl;    // 5
	//cout << a++ << endl;  // 5
	//cout << a << endl;  // 6
	//cout << ++a << endl;  // 7
	//cout << a << endl;    // 7





	/*cout << "Hello C++" << endl;
	cout << 1234 << endl;
	cout << "Мене звати Сергій" << endl;*/

	// type name;

	// bool  - 1b

	// char  - 1b

	// short - 2b
	// int   - 4b
	// long  - 4b
	// long long - 8b

	// float - 4b (7)
	// double - 8b (15)
	// long doble - 10b 

	/*int a;
	int b = 5;
	a = 10;
	cout << &a << endl;*/

	/*int c = 1.99f;
	cout << c << endl;*/

	/*unsigned int a = -1;
	cout << a << endl;

	const int b = 22;*/
	//b = 10;







	system("pause");
}